In [25]:
import pandas as pd
import numpy as np

In [33]:
a = pd.DataFrame({'x': [1,2,3],
              'y': [4,4,4],
              'col': [1,-1,1]})
a

   x  y  col
0  1  4    1
1  2  4   -1
2  3  4    1

In [74]:
b = a.x + a.y
idd = (b == max(b))
id2 = (b %2 == 1)
print(idd)
print(id2)

0    False
1    False
2     True
dtype: bool
0     True
1    False
2     True
dtype: bool

In [65]:
np.count_nonzero(id2)

2

In [68]:
abs(a.col)

0    1
1    1
2    1
Name: col, dtype: int64

In [108]:
a[a.x == max(a.x)]
a

   x  y  col
0  1  4    1
1  2  4   -1
2  3  4    1

In [119]:
np.array(a[b == max(b)])
a.loc[0,'x'] = -8
b[0] = -8

In [142]:
abs(b * id2)
c = a.loc[1]
c

x      2
y      4
col   -1
Name: 1, dtype: int64

In [162]:

c = a[b == max(b)]
c

   x  y  col
2  3  4    1

In [219]:
np.array(c.iloc[0,[0,1]]) 

c.iloc[0,0]

3